package tasks.multitreading.TaskScheduler;

public class Runner {
    // Разработайте планировщик задач, где каждая задача имеет приоритет:
    // Создайте класс Task, который содержит: Имя задачи, Приоритет задачи (TaskPriority)
    // Реализуйте класс TaskScheduler, который: Принимает задачи от разных потоков, выполняет задачи в порядке убывания
    // приоритета (сначала HIGH, затем MEDIUM, потом LOW)
    // Используйте BlockingQueue или PriorityQueue для хранения задач.
    // Усложнение: Добавьте возможность динамически изменять приоритет задачи во время выполнения.

}
