package tasks.patterns.strategy.discount_system;

// Ты разрабатываешь систему скидок для интернет-магазина. У магазина есть разные типы скидок:
// По проценту (например, -10%).
// Фиксированная (например, -500 рублей).
// Кэшбэк (например, 5% возвращается на баланс).
// В будущем могут появиться новые типы скидок.
// Клиент может выбрать, какую скидку применить.
// Нужно рассчитать финальную цену и вывести информацию о скидке.

public class Runner {
    public static void main(String[] args) {

    }
}
